# 1. Напишите программу, которая принимает на вход цифру,
# обозначающую день недели, и проверяет, является ли этот день выходным.
# *Пример:*
#
# - 6 -> да
# - 7 -> да
# - 1 -> нет
day_number = int(input("Введите номер дня недели: "))
if 5 < day_number < 8:
    print(f"- {day_number} -> да")
elif 1 <= day_number <=5:
    print(f"- {day_number} -> нет")
else:
    print("Это не номер дня недели.")