# 2. Для чисел в пределах от 20 до N найти числа, кратные 20 или 21. Use comprehension.
# in                                      in
# 100                                     424
# out                                     out
# [20, 21, 40, 42, 60, 63, 80, 84, 100]   [20, 21, 40, 42, 60, 63, 80, 84, 100, 105, 120,
#                                           126, 140, 147, 160, 168, 180, 189, 200, 210, 220,
#                                           231, 240, 252, 260, 273, 280, 294, 300, 315, 320, 336,
#                                           340, 357, 360, 378, 380, 399, 400, 420]
def multiple_value_list(num, d1=20, d2=21):
    if num.isdigit() and int(num) >=d1:
        print([e for e in range(20, int(num) + 1) if e % d1 == 0 or e % d2 == 0])
    else:
        print("Введено екорректное значение")

multiple_value_list(input())